const MATH_PAIRS: [(&str, &str); 2] = [("Синус;", SIN), ("Модуль;", ABS)];

pub fn get_math_func(name: &str) -> Option<&'static str> {
    MATH_PAIRS
        .iter()
        .find(|(key, _)| *key == name)
        .map(|(_, value)| *value)
}

const ABS: &str = r"
алгоритм Модуль(а: Десятич) -> Десятич
Начало 
    если а < 0 то 
        вернуть а * -1;
    иначе вернуть а;
Конец
";

const SIN: &str = r"
алгоритм Синус(х: Десятич) -> Десятич Начало
    если х < -![ПИ] ИЛИ х > ![ПИ] нч
        х = х - ![ПИ2] * (Нат)(х / ![ПИ2]);
        если х > ![ПИ] то х -= ![ПИ2];
        если х < -![ПИ] то х += ![ПИ2];
    кц
    
    если х > ![ПИ]/2 то
        х = ![ПИ] - х;
    иначе если х < -![ПИ]/2 то
        х = -![ПИ] - х; 

    пусть х2: Десятич = х * х; 
    пусть ответ: Десятич = 
        х * (1.0 - х2 * (1.0/6.0 - х2 * (1.0/120.0 - х2 * (1.0/5040.0 - х2 * 1.0/362880.0))));
    вернуть ответ;
Конец
";
